{
    "Config": {
        "Name": "IMDB-Reviews",
        "Tasks": [
            {
                "Type": "SequenceClassification",
                "Classes": [
                    "Negative",
                    "Positive"
                ],
                "ActiveLearning": {
                    "Enabled": true,
                    "Start": 1,
                    "ModelName": "LogRegUncertainty"
                }
            },
            {
                "Type": "SequenceClassification",
                "Classes": [
                    "Strong",
                    "Weak"
                ],
                "ActiveLearning": {
                    "Enabled": true,
                    "Start": 1,
                    "ModelName": "LogRegUncertainty"
                }
            }
        ]
    },
    "Texts": [
        "Like a lot of horror fans out there that went looking for the next great scare flick, we plundered the Asian horror market for whatever we could get our hands on, leaving no dark haired ghost lady unturned. We had good reason to do so, the Asian market had spawned such terrifying wonders as Ringu, Dark Waters, Juon - the Grudge, and a Tale of Two Sisters. By the time Takashi Miike started ripping the mick out of the genre with One Missed Call in 2003, the market seemed to be drying up, leaving it open for mockery and derision, despite the continued Hollywood Remake Machine working full steam ahead. Now, don't get me wrong, there were still plenty of good Asian horrors being made, the likes of Marebito and Shutter, to mention but two, will stand as minor genre classics some day. But the lank haired ghost lady had definitely had her feed at the party, and was time to take that success-drunk tramp home to bed! Then along comes a film like Noroi - The Curse. A film that is smart enough to pay subtle homage to it's roots, yet throws the rulebook out the window whilst doing it. What I'm about to describe in terms of plot will probably make you think there is nothing new here at all. The film is a documentary about one of Japan's top paranormal investigators as he receives stories and tip offs on ghostly goings on. He starts investigating the claims by a woman that she regularly hears a baby crying in the house next door, yet there is no baby there, apart from a middle aged woman and her son. These two disappear sharpish when the reporter pokes his nose around, but strange other coincidences start popping up. A psychic young girl, a mentally ill clairvoyant, a pretty young actress who had a strange vision, a lot of dead pigeons, and a very sinister demon by the name of Kagutaba, leading to a truly terrifying showdown in a small historical town...<br /><br />To say any more on the plot might ruin the fun a bit. The film is shot in 'faux documentary' fashion, and incorporates footage from TV shows and news reports, and the labels via subtitles lets you know where you are in terms of the time line. The film has drawn more than a few comparisons to the Blair Witch Project, but apart from the shooting format and the creepy trip through the woods late at night, the comparison ends there really.<br /><br />What is refreshing about Noroi is how it doesn't pander to modern horror audiences. If you are expecting croaky ghost ladies to pop out of the attic, look elsewhere. The film's strength lies in it's slow, gradual build up of terror, a terror so profound that it will stick with you for days after watching it. The climax is pretty damned freaky, but just when you think the film is over, you get treated to the 'real' ending when the credits start to roll, and sweet holy f*ck, is it a killer. In terms of acting, it is mostly convincing. You get some 'comedy' relief from the crazy, tin foil covered clairvoyant, but that soon dries up half way through the film. The film also has a slightly 'nastier' feel than a lot of Asian ghost horror, as there is a violent streak to some of the events too.<br /><br />Overall, Noroi is one to watch on your own, late at night. Not since my first viewing of Ringu ten years ago have I been so delightfully creeped out watching a horror film. It is one that will itch away at you until it is too late, then it is under your skin. Just let yourself go to this one completely. And not a lank haired ghost lady in sight?? No wonder it has barely been released outside of Japan, let alone had an American remake lined up yet. Check this one out if you can, essential viewing in my books!",
        "The Japenese sense of pacing, editing and musical score must be different than American tastes, but surely this movie could have been so much more with a little more post production work.<br /><br />Someone in Hollywood needs to re-make this movie and I think it would be a big hit. The story is interesting and creepy. There's something about the edges of the city, gritty policemen, earthquakes, sanitariums and mysterious saltwater killings that is enough to be captivating. However, this story has to make just a little bit of sense and maybe be about 40 minutes shorter.<br /><br />I do have to say that the \"sixth-sense\" effect was in full force in this movie, and that was evident from the very beginning.<br /><br />As it stands, only the die-hard Japanese film lovers should bother seeing this oh-so-boring movie.",
        "This was a very brief episode that appeared in one of the \"Night Gallery\" show back in 1971. The episode starred Sue Lyon (of Lolita movie fame) and Joseph Campanella who play a baby sitter and a vampire, respectively. The vampire hires a baby sitter to watch his child (which appears to be some kind of werewolf or monster) while he goes out at night for blood. The baby sitter is totally oblivious to the vampire's appearance when she first sees him and only starts to put two and two together when she notices that he has no reflection in the mirror, has an odd collection of books in the library on the occult, and hears strange noises while the vampire goes to talk to the child. She realizes that the man who hired her may not be what she thought he was originally. She bolts out the door, the vampire comes out looking puzzled and the episode is over. I don't know what purpose it was to make such an abbreviated episode that lasted just 5 minutes. They should just have expanded the earlier episode by those same 5 minutes and skipped this one. A total wasted effort.",
        "Absolutely the most boring movie I have ever spent my money on.This was a wrong choice for all these great stars to waste their reputations on. Boring! boring! boring! Each character was portrayed in a less than inspirational way. No acting talent shown -just reading a part. Alec can play realistic characters normally, Gwynyth made herself look ugly for an unrewarding part, Annette needs advise on how to pick the movies she chooses to play in as do all these big stars who have left me disappointed at the way they have all allowed their talents to be smothered in a feature that leaves much to be desired in entertainment. \"Running with scissors\" leads the public to anticipate great acting in a film that suggests experiencing tension and deep emotion. There was not one moment when the cast was able to portray any interpretation of this onto the screen. Maybe it was the director's fault----whatever.",
        "I saw this film at the 2005 Palm Springs International Film Festival. I went in with the assumption that if it stars Chiwetel Ejiofor and Hilary Swank it had to be at least decent. Well, after a kind of a slow start, I was far from disappointed. In fact, I was quite pleased with the final product.<br /><br />I must admit the Afrikaaner and Xhosa(?) accented English of some of the actors were kind of hard to understand but like seeing \"Waking Ned Devine\", \"Trainspotting\" or any other film with heavy-accented actors I adjusted after about 15 minutes. And I was trying to figure out why Hilary Swank was supposed to be South African and sounded like she was trying to put on an accent but sounded very American... as if she was making a weak attempt at putting on the accent. But later in the film as more is revealed about her character and how she moved to the US as a teen you begin to understand how she might have lost some or most of her accent. So it began to make sense that only certain words might have a Afrikaaner lilt to them.<br /><br />I know it's a little weak for one to use film as education but one of the great things about this film is that it was interesting to see a dramatization of a Truth and Reconciliation trial. I'd heard about the T and R process in South Africa after the fall of apartheid but I didn't really know how it worked.<br /><br />The final verdict is that although some of the scenes felt a little contrived, this was overall a very strong film. The closing sequence where the \"truth\" comes out was the strong finish every film hopes for. A definite must see for anyone who cares about what happens outside their borders.",
        "One would think that with all the lavish care and expense that went into this made-for-TV movie, it would reflect something of the taste and manners of the upper class couple--Wallis Simpson and the Prince of Wales--instead of being a mawkish, unappetizing historical romance.<br /><br />Nor is it helped by the fact that JANE SEYMOUR and ANTHONY ANDREWS give stiff, rather uncomfortable to watch performances in which the events move much too slowly to hold attention.<br /><br />It's hard to understand why a star of OLIVIA DE HAVILLAND's caliber would wish to play the supporting role of Aunt Bessie since the role is so colorless she just about fades out of sight. At this stage in her career, Olivia was appearing in so many \"nobility\" roles requiring a regal presence but nothing more.<br /><br />A trivial movie best left forgotten among all the made-for-TV movies of that era."
    ]
}
